[M_Orchid_SmellsLikeVictory MissionDefinition]
MissionDescription="Mercer, the cook for Scarlett's crew, needs you to get rid of the smelly radio operator Shiv-Spike. As Scarlett prefers her executions lively and interesting, Mercer has asked you to feed Shiv-Spike to a sandworm. This leads to another problem, however, Shiv-Spike smells like the inside of a dead skag. You'll need to find some condiments to make him a bit more appetizing."
TurnInDescription="Bon appétit!"
MissionSummary="Feed Shiv-Spike to a sandworm."
